## Concatenation

#### If the sources are already in the same format (same rows) the simplest way to combine the DataFrames is through concatenation

In [1]:
import numpy as np
import pandas as pd

In [5]:
# Pandas will automatically fill NaN values where necessary

data_one = {'A': ['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}
data_two = {'C': ['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}

In [6]:
one = pd.DataFrame(data_one)

In [7]:
two = pd.DataFrame(data_two)

In [8]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [9]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [11]:
pd.concat([one,two], axis = 1)    # this is how you concatonate along the columns

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [12]:
two.columns = one.columns      # C and D are the same data as A and B (hypothetical)
                               # therefore set the columns equal so they line up

In [13]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [14]:
pd.concat([one,two])   # but the indices are still messed up!

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [15]:
mydf = pd.concat([one,two], axis = 0)

In [16]:
mydf.index = range(len(mydf))

In [17]:
mydf                                         # succesfully concatonated the dataframes along the rows 
                                             # with correct indices

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

## Inner Merge

#### Often DataFrames are not in the exact same order or format, meaning we can not simply concatenate them together.
#### In this case we need to merge the DataFrames. Analogous to JOIN command in SQL

In [18]:
# merge() takes an argument called how - this specifies if LEFT, RIGHT, or INNER JOIN

registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [19]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [20]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [21]:
# help(pd.merge)

pd.merge(registrations,logins, how = 'inner', on = 'name')     # order of tables doesn't matter in terms of information

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

## Left and Right Merge

#### Order of DataFrames being passed in MATTERS

In [22]:
pd.merge(left = registrations, right = logins, how = 'left', on = 'name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [23]:
pd.merge(left = registrations, right = logins, how = 'right', on = 'name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

## Outer Merge

#### Grabs all data from both tables

In [24]:
pd.merge(left = registrations, right = logins, how = 'outer', on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [25]:
registrations = registrations.set_index('name')

In [26]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [27]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [28]:
pd.merge(registrations, logins, left_index = True, right_on = 'name', how = 'inner')    
# how to merge tables when they dont share a column with the same name
# here we join on registration's index and login's column named 'name'

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [29]:
registrations = registrations.reset_index()

In [30]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [31]:
registrations.columns = ['reg_name', 'reg_id']

In [32]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [34]:
results = pd.merge(registrations, logins, how = 'inner', left_on = 'reg_name', right_on='name')

In [35]:
results.drop('reg_name', axis = 1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [37]:
registrations.columns = ['name','id']

In [38]:
logins.columns = ['id','name']

In [39]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [40]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [42]:
pd.merge(registrations, logins, how = 'inner', on = 'name', suffixes = ('_reg','_log'))  
#without assigning suffixes _x is default for left table and _y is for right table

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4